var ManualData = [
    {
        "bpm":197.2, // 곡의 bpm. 중간에 변경 가능
    
        /*
        이전 가사 종료 직후
        몇박자 쉬고 시작할지 지정.
        맨 처음 가사에서 사용 시
        맨처음 delay을 입력하지 않아도 됨.
    
        [
            {
                "bpm":197.2,"delay":a,
                "data":[ ... ]
            }
            // ...
        ]
        와 같이 쓰면 data의 가사를
        진행하기 전 a박자만큼 쉬게 됨
        */
        "delay":1.946,
        "delay_ms":200, // delay와 같으나 밀리초 단위. 둘을 같이 입력 시 더함

        // 가사
        "data":[
            ["글자","박자","밀리초추가(오차보정용,선택)"],
            {"bpm":"bpm을 바꾸려면 이렇게 쓴다","delay":"가사진행을 멈추고 박자를 쉬려면 이렇게 쓴다"},
            ["(괄호로 감싸면",19.72],
            ["색이 다르게 표시됨)",11.21]
        ]
    },
    {
        // 파라미터 입력
        // lastLyricsOfVerse를 넣으면 이 줄이 끝나고 가사를 숨김
        "param":["lastLyricsOfVerse"],
        "type":-1, // -1추임새 0디폴트 1남자 2여자 3남여같이
        "data":[
            ["처음 괄호를 연 데에서 괄호를 안 닫아도",19.72],
            ["줄이 넘어가면 영향을 받지 않지만",11.21],
            ["여기 줄은 type이 -1이므로 추임새/랩에 해당하는(=괄호로 감싼것과 같은) 색으로 변경됨",55]
        ]
    },

    // Warning : ms_start와 관련된 기능은 구현되어있지 않습니다
    // 명령어를 실행하는 부분. 배열 안에 감싸 입력
    // [["명령어","인자1","인자2",...(인자가 없으면 생략 가능)]]
    // ms_start : 이 시점부터 반주파일 기준 밀리초 단위로 기록(자세한건 아래 참조) : 구현 안됨
    // ms_end : ms_start가 앞에 있어야 작동함. ms_end가 나온 직후 원래대로 진행 : 구현 안됨
    // configure : 가사 레이아웃 등을 변경할 수 있음
    // 레이아웃(configure)의 경우 맨처음 한번 변경하거나 이미 가사가 있으면 변경 불가
    [["ms_start"],["configure",{ "layout":"jp" }]],
    {
        // 아까 param으로 가사를 숨겼으므로
        // 아래 delay은 간주의 박자가 돼야 하지만
        // ms_start로 밀리초 단위로 기록되게 했으므로 먹히지 않음
        // 가사 표시후 시작직전에 시작신호가 출력됨. 이건 맨처음도 마찬가지
        "delay":19.72,
        "sub":"내가- 고자라니 Ahhh 니미 씨라잇", // 일본/중국곡 모드에서만 지원. 발음표기
        "data":[
            // "내가- 고자라니"라고 읽음. "-"는 장(長)음
            // 이때 20387은 반주파일기준 가사 시작시간
            // 24031은 반주파일기준 가사 종료시간. 없을경우 다음가사 시작타이밍
            ["ネガーゴザラニ",20387,24031],
            /*
            루비 문자가 필요한 경우
            [["글자","루비문자"],"..."]
            와 같이 쓸 수 있음
            */
            [["Ahhh Nimi Shirait","アーーニミッシライッ"],24032,29010] // 줄이 끝날경우 종료시간 필요
        ]
    },
    {
        "sub":"Eight Naega Gozarani", // 발음표기
        "type":3,
        // 결과물 : "Eight Naega Gozarani"
        "data":[
            ["Eight",29012],
            null, // 띄어쓰기
            ["Naega",31019],
            [" ",0], // 이게 원형이다
            // type이 0이 아닐 경우 괄호의 영향을 전혀 받지 않음
            ["(Gozarani)",33049] // 이러면 에러 발생(줄이 끝났으므로 종료시간 필요)
        ]
    },
    [["ms_end",35017]] // 이러고 나면 반주파일기준 35017ms부터 원래대로 가게됨
]
